Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/atdf/ATSAMS70Q19B.atdf
        <register caption="AFEC Channel Enable Register" name="AFEC_CHER" offset="0x14" rw="W" size="4" atomic-op="set:AFEC_CHSR">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Enable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Enable" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Enable" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Enable" mask="0x00000800" name="CH11"/>
        </register>
        <register caption="AFEC Channel Disable Register" name="AFEC_CHDR" offset="0x18" rw="W" size="4" atomic-op="clear:AFEC_CHSR">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Disable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Disable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Disable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Disable" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Disable" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Disable" mask="0x00000800" name="CH11"/>
        </register>
        <register caption="AFEC Channel Status Register" name="AFEC_CHSR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Status" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Status" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Status" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Status" mask="0x00000800" name="CH11"/>
        </register>
        <register caption="AFEC Last Converted Data Register" name="AFEC_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x0000FFFF" name="LDATA"/>
          <bitfield caption="Channel Number" mask="0x0F000000" name="CHNB"/>
        </register>
        <register caption="AFEC Interrupt Enable Register" name="AFEC_IER" offset="0x24" rw="W" size="4" atomic-op="set:AFEC_IMR">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Enable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Enable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Enable 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Enable 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Enable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="Temperature Change Interrupt Enable" mask="0x40000000" name="TEMPCHG"/>
        </register>
        <register caption="AFEC Interrupt Disable Register" name="AFEC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:AFEC_IMR">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Disable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Disable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Disable 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Disable 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Disable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="Temperature Change Interrupt Disable" mask="0x40000000" name="TEMPCHG"/>
        </register>
        <register caption="AFEC Interrupt Mask Register" name="AFEC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:AFEC_IMR">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Mask 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Mask 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Mask 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Mask 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Mask" mask="0x04000000" name="COMPE"/>
          <bitfield caption="Temperature Change Interrupt Mask" mask="0x40000000" name="TEMPCHG"/>
        </register>
        <register caption="AFEC Interrupt Status Register" name="AFEC_ISR" offset="0x30" rw="R" size="4" atomic-op="clear:AFEC_ISR">
          <bitfield caption="End of Conversion 0 (cleared by reading AFEC_CDRx)" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1 (cleared by reading AFEC_CDRx)" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2 (cleared by reading AFEC_CDRx)" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3 (cleared by reading AFEC_CDRx)" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4 (cleared by reading AFEC_CDRx)" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5 (cleared by reading AFEC_CDRx)" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6 (cleared by reading AFEC_CDRx)" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7 (cleared by reading AFEC_CDRx)" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion 8 (cleared by reading AFEC_CDRx)" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion 9 (cleared by reading AFEC_CDRx)" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion 10 (cleared by reading AFEC_CDRx)" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion 11 (cleared by reading AFEC_CDRx)" mask="0x00000800" name="EOC11"/>
          <bitfield caption="Data Ready (cleared by reading AFEC_LCDR)" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error (cleared by reading AFEC_ISR)" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Error (cleared by reading AFEC_ISR)" mask="0x04000000" name="COMPE"/>
          <bitfield caption="Temperature Change (cleared on read)" mask="0x40000000" name="TEMPCHG"/>
        </register>
        <register caption="AFEC Overrun Status Register" name="AFEC_OVER" offset="0x4C" rw="R" size="4">
          <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00000010" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00000020" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
          <bitfield caption="Overrun Error 8" mask="0x00000100" name="OVRE8"/>
          <bitfield caption="Overrun Error 9" mask="0x00000200" name="OVRE9"/>
          <bitfield caption="Overrun Error 10" mask="0x00000400" name="OVRE10"/>
          <bitfield caption="Overrun Error 11" mask="0x00000800" name="OVRE11"/>
        </register>
        <register caption="AFEC Compare Window Register" name="AFEC_CWR" offset="0x50" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x0000FFFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0xFFFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="AFEC Channel Gain Register" name="AFEC_CGR" offset="0x54" rw="RW" size="4">
          <bitfield caption="Gain for Channel 0" mask="0x00000003" name="GAIN0"/>
          <bitfield caption="Gain for Channel 1" mask="0x0000000C" name="GAIN1"/>
          <bitfield caption="Gain for Channel 2" mask="0x00000030" name="GAIN2"/>
          <bitfield caption="Gain for Channel 3" mask="0x000000C0" name="GAIN3"/>
          <bitfield caption="Gain for Channel 4" mask="0x00000300" name="GAIN4"/>
          <bitfield caption="Gain for Channel 5" mask="0x00000C00" name="GAIN5"/>
          <bitfield caption="Gain for Channel 6" mask="0x00003000" name="GAIN6"/>
          <bitfield caption="Gain for Channel 7" mask="0x0000C000" name="GAIN7"/>
          <bitfield caption="Gain for Channel 8" mask="0x00030000" name="GAIN8"/>
          <bitfield caption="Gain for Channel 9" mask="0x000C0000" name="GAIN9"/>
          <bitfield caption="Gain for Channel 10" mask="0x00300000" name="GAIN10"/>
          <bitfield caption="Gain for Channel 11" mask="0x00C00000" name="GAIN11"/>
        </register>
