Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/atdf/ATSAMS70Q19B.atdf
        <register offset="0x00000330" size="1" name="NVICIP48" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI48" caption="Priority of interrupt 48"/>
        </register>
        <register offset="0x00000331" size="1" name="NVICIP49" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI49" caption="Priority of interrupt 49"/>
        </register>
        <register offset="0x00000332" size="1" name="NVICIP50" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI50" caption="Priority of interrupt 50"/>
        </register>
        <register offset="0x00000333" size="1" name="NVICIP51" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI51" caption="Priority of interrupt 51"/>
        </register>
        <register offset="0x00000334" size="1" name="NVICIP52" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI52" caption="Priority of interrupt 52"/>
        </register>
        <register offset="0x00000335" size="1" name="NVICIP53" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI53" caption="Priority of interrupt 53"/>
        </register>
        <register offset="0x00000336" size="1" name="NVICIP54" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI54" caption="Priority of interrupt 54"/>
        </register>
        <register offset="0x00000337" size="1" name="NVICIP55" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI55" caption="Priority of interrupt 55"/>
        </register>
        <register offset="0x00000338" size="1" name="NVICIP56" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI56" caption="Priority of interrupt 56"/>
        </register>
        <register offset="0x00000339" size="1" name="NVICIP57" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI57" caption="Priority of interrupt 57"/>
        </register>
        <register offset="0x0000033a" size="1" name="NVICIP58" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI58" caption="Priority of interrupt 58"/>
        </register>
        <register offset="0x0000033b" size="1" name="NVICIP59" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI59" caption="Priority of interrupt 59"/>
        </register>
        <register offset="0x0000033c" size="1" name="NVICIP60" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI60" caption="Priority of interrupt 60"/>
        </register>
        <register offset="0x0000033d" size="1" name="NVICIP61" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI61" caption="Priority of interrupt 61"/>
        </register>
        <register offset="0x0000033e" size="1" name="NVICIP62" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI62" caption="Priority of interrupt 62"/>
        </register>
        <register offset="0x0000033f" size="1" name="NVICIP63" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI63" caption="Priority of interrupt 63"/>
        </register>
        <register offset="0x00000340" size="1" name="NVICIP64" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI64" caption="Priority of interrupt 64"/>
        </register>
        <register offset="0x00000341" size="1" name="NVICIP65" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI65" caption="Priority of interrupt 65"/>
        </register>
        <register offset="0x00000342" size="1" name="NVICIP66" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI66" caption="Priority of interrupt 66"/>
        </register>
        <register offset="0x00000343" size="1" name="NVICIP67" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI67" caption="Priority of interrupt 67"/>
        </register>
        <register offset="0x00000344" size="1" name="NVICIP68" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI68" caption="Priority of interrupt 68"/>
        </register>
        <register offset="0x00000345" size="1" name="NVICIP69" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI69" caption="Priority of interrupt 69"/>
        </register>
        <register offset="0x00000346" size="1" name="NVICIP70" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI70" caption="Priority of interrupt 70"/>
        </register>
        <register offset="0x00000347" size="1" name="NVICIP71" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI71" caption="Priority of interrupt 71"/>
        </register>
        <register offset="0x00000348" size="1" name="NVICIP72" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI72" caption="Priority of interrupt 72"/>
        </register>
        <register offset="0x00000349" size="1" name="NVICIP73" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI73" caption="Priority of interrupt 73"/>
        </register>
        <register offset="0x0000034a" size="1" name="NVICIP74" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI74" caption="Priority of interrupt 74"/>
        </register>
        <register offset="0x0000034b" size="1" name="NVICIP75" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI75" caption="Priority of interrupt 75"/>
        </register>
        <register offset="0x0000034c" size="1" name="NVICIP76" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI76" caption="Priority of interrupt 76"/>
        </register>
        <register offset="0x0000034d" size="1" name="NVICIP77" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI77" caption="Priority of interrupt 77"/>
        </register>
        <register offset="0x0000034e" size="1" name="NVICIP78" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI78" caption="Priority of interrupt 78"/>
        </register>
        <register offset="0x0000034f" size="1" name="NVICIP79" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI79" caption="Priority of interrupt 79"/>
        </register>
        <register offset="0x00000350" size="1" name="NVICIP80" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI80" caption="Priority of interrupt 80"/>
        </register>
        <register offset="0x00000351" size="1" name="NVICIP81" initval="0" caption="Interrupt Priority Register n">
          <bitfield mask="0x000000ff" name="PRI81" caption="Priority of interrupt 81"/>
        </register>
